{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "function_type": "lambda", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-16-10ea02888b3d>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "name": "lambda_1", "output_shape": [66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 24, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "nb_col": 5, "activation": "linear", "name": "convolution2d_1", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "bias": true, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 36, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "nb_col": 5, "activation": "linear", "name": "convolution2d_2", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "bias": true, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 48, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "nb_col": 5, "activation": "linear", "name": "convolution2d_3", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "bias": true, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 64, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "nb_col": 3, "activation": "linear", "name": "convolution2d_4", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 64, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "nb_col": 3, "activation": "linear", "name": "convolution2d_5", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 100, "trainable": true, "W_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "input_dim": 1152, "bias": true, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 50, "trainable": true, "W_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "input_dim": 100, "bias": true, "activity_regularizer": null, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 10, "trainable": true, "W_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "input_dim": 50, "bias": true, "activity_regularizer": null, "name": "dense_3"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 1, "trainable": true, "W_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "input_dim": 10, "bias": true, "activity_regularizer": null, "name": "dense_4"}}]}