{"keras_version": "1.2.0", "config": [{"config": {"function_type": "lambda", "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "output_shape": [66, 200, 3], "input_dtype": "float32", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa <ipython-input-192-10ea02888b3d>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "name": "lambda_23"}, "class_name": "Lambda"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "nb_filter": 24, "nb_col": 5, "activity_regularizer": null, "trainable": true, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "activation": "linear", "subsample": [2, 2], "name": "convolution2d_84", "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_45", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "nb_filter": 36, "nb_col": 5, "activity_regularizer": null, "trainable": true, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "activation": "linear", "subsample": [2, 2], "name": "convolution2d_85", "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_46", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "nb_filter": 48, "nb_col": 5, "activity_regularizer": null, "trainable": true, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "activation": "linear", "subsample": [2, 2], "name": "convolution2d_86", "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_47", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "trainable": true, "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "activation": "linear", "subsample": [1, 1], "name": "convolution2d_87", "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_48", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "trainable": true, "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "activation": "linear", "subsample": [1, 1], "name": "convolution2d_88", "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_49", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_25", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": 1152, "b_constraint": null, "activation": "linear", "name": "dense_63", "W_regularizer": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_50", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": 100, "b_constraint": null, "activation": "linear", "name": "dense_64", "W_regularizer": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_51", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": 50, "b_constraint": null, "activation": "linear", "name": "dense_65", "W_regularizer": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_52", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": 10, "b_constraint": null, "activation": "linear", "name": "dense_66", "W_regularizer": null, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential"}