{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "arguments": {}, "name": "lambda_1", "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "output_shape": [66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-16-10ea02888b3d>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "b_regularizer": null, "bias": true, "nb_col": 5, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "W_constraint": null, "activation": "linear", "nb_filter": 24, "name": "convolution2d_1", "W_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "b_regularizer": null, "bias": true, "nb_col": 5, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "W_constraint": null, "activation": "linear", "nb_filter": 36, "name": "convolution2d_2", "W_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "b_regularizer": null, "bias": true, "nb_col": 5, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "W_constraint": null, "activation": "linear", "nb_filter": 48, "name": "convolution2d_3", "W_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "b_regularizer": null, "bias": true, "nb_col": 3, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "W_constraint": null, "activation": "linear", "nb_filter": 64, "name": "convolution2d_4", "W_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "b_regularizer": null, "bias": true, "nb_col": 3, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "W_constraint": null, "activation": "linear", "nb_filter": 64, "name": "convolution2d_5", "W_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 100, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "activation": "linear", "input_dim": 1152, "name": "dense_1", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 50, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "activation": "linear", "input_dim": 100, "name": "dense_2", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 10, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "activation": "linear", "input_dim": 50, "name": "dense_3", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 1, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "activation": "linear", "input_dim": 10, "name": "dense_4", "W_regularizer": null}}], "keras_version": "1.2.1"}